export const statusMap = {
  0: {
    status: 'default',
    text: '关闭'
  },
  1: {
    status: 'processing',
    text: '运行中'
  },
  2: {
    status: 'success',
    text: '已上线'
  },
  3: {
    status: 'error',
    text: '异常'
  }
}
export const areaPlate = {
  青浦: ['白鹤', '华新', '金泽', '练塘', '夏阳', '香花桥', '徐泾', '盈浦', '赵巷', '重固', '朱家角'],
  松江: [
    '泗泾',
    '松江老城',
    '小昆山',
    '九亭',
    '佘山',
    '车墩',
    '新桥',
    '松江大学城',
    '松江新城',
    '莘闵别墅',
    '石湖荡',
    '叶榭',
    '泖港',
    '新浜'
  ],
  嘉定: [
    '江桥',
    '菊园新区',
    '嘉定新城',
    '安亭',
    '南翔',
    '徐行',
    '丰庄',
    '外冈',
    '马陆',
    '华亭',
    '嘉定老城',
    '新成路',
    '上大'
  ],
  奉贤: ['南桥', '海湾', '奉城', '青村', '四团', '奉贤金汇', '柘林', '西渡', '庄行'],
  浦东: [
    '临港新城',
    '梅园',
    '康桥',
    '书院镇',
    '曹路',
    '万祥镇',
    '唐镇',
    '杨思前滩',
    '北蔡',
    '花木',
    '御桥',
    '外高桥',
    '合庆',
    '惠南',
    '张江',
    '洋泾',
    '高行',
    '川沙',
    '泥城镇',
    '周浦',
    '祝桥',
    '大团镇',
    '杨东',
    '金桥',
    '老港镇',
    '新场',
    '世博',
    '南码头',
    '塘桥',
    '三林',
    '航头',
    '宣桥',
    '陆家嘴',
    '源深',
    '金杨',
    '联洋',
    '碧云',
    '潍坊'
  ],
  宝山: [
    '上大',
    '罗泾',
    '罗店',
    '大场镇',
    '杨行',
    '顾村',
    '淞宝',
    '淞南',
    '大华',
    '共康',
    '高境',
    '月浦',
    '通河',
    '张庙',
    '共富'
  ],
  闵行: [
    '莘庄',
    '颛桥',
    '浦江',
    '马桥',
    '龙柏',
    '华漕',
    '老闵行',
    '金汇',
    '金虹桥',
    '吴泾',
    '春申',
    '古美',
    '梅陇',
    '静安新城',
    '七宝',
    '航华'
  ],
  徐汇: [
    '建国西路',
    '徐汇滨江',
    '田林',
    '龙华',
    '漕河泾',
    '康健',
    '衡山路',
    '徐家汇',
    '斜土路',
    '华泾',
    '华东理工',
    '植物园',
    '长桥',
    '上海南站',
    '万体馆'
  ],
  长宁: ['北新泾', '仙霞', '西郊', '天山', '新华路', '中山公园', '古北', '镇宁路', '虹桥'],
  静安: ['大宁', '不夜城', '水和', '西藏北路', '彭浦', '江宁路', '闸北公园', '阳城', '南京西路', '曹家渡', '静安寺'],
  普陀: ['长风', '光新', '长征', '真如', '武宁', '甘泉宜川', '真光', '万里', '桃浦', '中远两湾城', '曹杨', '长寿路'],
  杨浦: ['东外滩', '周家嘴路', '控江路', '中原', '新江湾城', '五角场', '黄兴公园', '鞍山', '高境'],
  黄浦: [
    '豫园',
    '蓬莱公园',
    '老西门',
    '南京东路',
    '人民广场',
    '董家渡',
    '世博滨江',
    '新天地',
    '淮海中路',
    '打浦桥',
    '黄浦滨江',
    '五里桥'
  ],
  虹口: ['江湾镇', '临平路', '北外滩', '凉城', '四川北路', '鲁迅公园', '曲阳'],
  金山: ['张堰', '枫泾', '亭林', '山阳', '朱泾', '吕巷', '金山', '石化', '廊下', '漕泾'],
  崇明: ['崇明新城', '陈家镇', '长兴岛', '堡镇', '横沙岛', '崇明其它']
}
export const areaOptions = [
  {
    label: '青浦',
    value: '青浦'
  },
  {
    label: '嘉定',
    value: '嘉定'
  },
  {
    label: '松江',
    value: '松江'
  },
  {
    label: '奉贤',
    value: '奉贤'
  },
  {
    label: '浦东',
    value: '浦东'
  },
  {
    label: '闵行',
    value: '闵行'
  },
  {
    label: '徐汇',
    value: '徐汇'
  },
  {
    label: '宝山',
    value: '宝山'
  },
  {
    label: '长宁',
    value: '长宁'
  },
  {
    label: '静安',
    value: '静安'
  },
  {
    label: '普陀',
    value: '普陀'
  },
  {
    label: '杨浦',
    value: '杨浦'
  },
  {
    label: '黄浦',
    value: '黄浦'
  },
  {
    label: '虹口',
    value: '虹口'
  },
  {
    label: '金山',
    value: '金山'
  },
  {
    label: '崇明',
    value: '崇明'
  }
]
export const loopSummaryOptions = [
  {
    label: '内环内',
    value: '内环内'
  },
  {
    label: '内环至中环',
    value: '内环至中环'
  },
  {
    label: '中环至外环',
    value: '中环至外环'
  },
  {
    label: '外环外',
    value: '外环外'
  }
]

export const averageLlistedPriceOptions = [
  {
    'label': '2万以下',
    'value': '0-2'
  },
  {
    'label': '2-3万',
    'value': '2-3'
  },
  {
    'label': '3-4万',
    'value': '3-4'
  },
  {
    'label': '4-5万',
    'value': '4-5'
  },
  {
    'label': '5-6万',
    'value': '5-6'
  },
  {
    'label': '6-7万',
    'value': '6-7'
  },
  {
    'label': '7-8万',
    'value': '7-8'
  },
  {
    'label': '8-9万',
    'value': '8-9'
  },
  {
    'label': '9-10万',
    'value': '9-10'
  },
  {
    'label': '10-11万',
    'value': '10-11'
  },
  {
    'label': '11-12万',
    'value': '11-12'
  },
  {
    'label': '12-13万',
    'value': '12-13'
  },
  {
    'label': '13-14万',
    'value': '13-14'
  },
  {
    'label': '15万以上',
    'value': '15'
  }
]
export const totalPriceOptions = [
  {
    'label': '200万以下',
    'value': '0-200'
  },
  {
    'label': '200-300万',
    'value': '200-300'
  },
  {
    'label': '300-400万',
    'value': '300-400'
  },
  {
    'label': '400-500万',
    'value': '400-500'
  },
  {
    'label': '500-600万',
    'value': '500-600'
  },
  {
    'label': '600-700万',
    'value': '600-700'
  },
  {
    'label': '700-800万',
    'value': '700-800'
  },
  {
    'label': '800-900万',
    'value': '800-900'
  },
  {
    'label': '900-1000万',
    'value': '900-1000'
  },
  {
    'label': '1100-1200万',
    'value': '1100-1200'
  },
  {
    'label': '1200-1300万',
    'value': '1200-1300'
  },
  {
    'label': '1300-1400万',
    'value': '1300-1400'
  },
  {
    'label': '1400-1500万',
    'value': '1400-1500'
  },
  {
    'label': '1500万以上',
    'value': '1500'
  }
]
export const roomAreaOptions = [
  {
    'label': '50平方以下',
    'value': '0-50'
  },
  {
    'label': '50-60平方',
    'value': '50-60'
  },
  {
    'label': '60-70平方',
    'value': '60-70'
  },
  {
    'label': '70-80平方',
    'value': '70-80'
  },
  {
    'label': '80-90平方',
    'value': '80-90'
  },
  {
    'label': '90-100平方',
    'value': '90-100'
  },
  {
    'label': '100-110平方',
    'value': '100-110'
  },
  {
    'label': '110-120平方',
    'value': '110-120'
  },
  {
    'label': '120-130平方',
    'value': '120-130'
  },
  {
    'label': '130-140平方',
    'value': '130-140'
  },
  {
    'label': '140-150平方',
    'value': '140-150'
  },
  {
    'label': '150平方以上',
    'value': '150'
  }
]

export const constructionAgeOptions = [
  {
    'label': '1990年以前',
    'value': '1990-1990'
  },
  {
    'label': '1990-1995',
    'value': '1990-1995'
  },
  {
    'label': '1995-2000',
    'value': '1995-2000'
  },
  {
    'label': '2000-2005',
    'value': '2000-2005'
  },
  {
    'label': '2005-2010',
    'value': '2005-2010'
  },
  {
    'label': '2010年以后',
    'value': '2010'
  }
]

export const booleanOptions = [
  {
    label: '是',
    value: 1
  },
  {
    label: '否',
    value: 0
  }
]

export const liftOptions = [
  {
    label: '有电梯',
    value: '1'
  },
  {
    label: '无电梯',
    value: '0'
  }, {
    label: '其他',
    value: '2'
  }
]

export const subwayOptions = [
  {
    'line': '1号线',
    'station': ['莘庄', '外环路', '莲花路', '锦江乐园', '上海南站', '漕宝路', '上海体育馆', '徐家汇', '衡山路', '常熟路', '陕西南路', '黄陂南路', '人民广场', '新闸路', '汉中路', '上海火车站', '中山北路', '延长路', '上海马戏城', '汶水路', '彭浦新村', '共康路', '通河新村', '呼兰路', '共富新村', '宝安公路', '友谊西路', '富锦路']
  },
  {
    'line': '2号线',
    'station': ['徐泾东', '虹桥火车站', '虹桥2号航站楼', '淞虹路', '北新泾', '威宁路', '娄山关路', '中山公园', '江苏路', '静安寺', '南京西路', '人民广场', '南京东路', '陆家嘴', '东昌路', '世纪大道', '上海科技馆', '世纪公园', '龙阳路', '张江高科', '金科路', '广兰路', '唐镇', '创新中路', '华夏东路', '川沙', '凌空路', '远东大道', '海天三路', '浦东国际机场']
  },
  {
    'line': '3号线',
    'station': ['上海南站', '石龙路', '龙漕路', '漕溪路', '宜山路', '虹桥路', '延安西路', '中山公园', '金沙江路', '曹杨路', '镇坪路', '中潭路', '上海火车站', '宝山路', '东宝兴路', '虹口足球场', '赤峰路', '大柏树', '江湾镇', '殷高西路', '长江南路', '淞发路', '张华浜', '淞滨路', '水产路', '宝杨路', '友谊路', '铁力路', '江杨北路']
  },
  {
    'line': '4号线',
    'station': ['上海体育馆', '宜山路', '虹桥路', '延安西路', '中山公园', '金沙江路', '曹杨路', '镇坪路', '中潭路', '上海火车站', '宝山路', '海伦路', '临平路', '大连路', '杨树浦路', '浦东大道', '世纪大道', '浦电路', '蓝村路', '塘桥', '南浦大桥', '西藏南路', '鲁班路', '大木桥路', '东安路', '上海体育场']
  },
  {
    'line': '5号线',
    'station': ['莘庄', '春申路', '银都路', '颛桥', '北桥', '剑川路', '东川路', '金平路', '华宁路', '文井路', '闵行开发区', '江川路', '西渡', '萧塘', '奉浦大道', '环城东路', '望园路', '金海湖', '奉贤新城']
  },
  {
    'line': '6号线',
    'station': ['东方体育中心', '灵岩南路', '上南路', '华夏西路', '高青路', '东明路', '高科西路', '临沂新村 ', '上海儿童医学中心', '蓝村路', '浦电路 ', '世纪大道', '源深体育中心', '民生路', '北洋泾路', '德平路', '云山路', '金桥路', '博兴路', '五莲路', '巨峰路', '东靖路', '五洲大道', '洲海路', '外高桥保税区南站', '航津路', '外高桥保税区北站', '港城路']
  },
  {
    'line': '7号线',
    'station': ['美兰湖', '罗南新村', '潘广路', '刘行', '顾村公园', '祁华路', '上海大学', '南陈路', '上大路', '场中路', '大场镇', '行知路', '大华三路', '新村路', '岚皋路', '镇坪路', '长寿路', '昌平路', '静安寺', '常熟路', '肇嘉浜路', '东安路', '龙华中路', '后滩', '长清路', '耀华路', '云台路', '高科西路', '杨高南路', '锦绣路', '芳华路', '龙阳路', '花木路']
  },
  {
    'line': '8号线',
    'station': ['沈杜公路', '联航路', '江月路', '浦江镇', '芦恒路', '凌兆新村', '东方体育中心', '杨思', '成山路', '耀华路', '中华艺术宫', '西藏南路', '陆家浜路', '老西门', '大世界', '人民广场', '曲阜路', '中兴路', '西藏北路', '虹口足球场', '曲阳路', '四平路', '鞍山新村', '江浦路', '黄兴路', '延吉中路', '黄兴公园', '翔殷路', '嫩江路', '市光路']
  },
  {
    'line': '9号线',
    'station': ['松江南站', '醉白池', '松江体育中心', '松江新城', '松江大学城', '洞泾', '佘山', '泗泾', '九亭', '中春路', '七宝', '星中路', '合川路', '漕河泾开发区', '桂林路', '宜山路', '徐家汇', '肇嘉浜路', '嘉善路', '打浦桥', '马当路', '陆家浜路', '小南门', '商城路', '世纪大道', '杨高中路', '芳甸路', '蓝天路', '台儿庄路', '金桥', '金吉路', '金海路', '顾唐路', '民雷路', '曹路']
  },
  {
    'line': '10号线',
    'station': ['航中路', '紫藤路', '龙柏新村', '虹桥火车站', '虹桥2号航站楼', '虹桥1号航站楼', '上海动物园', '龙溪路', '水城路', '伊犁路', '宋园路', '虹桥路', '交通大学', '上海图书馆', '陕西南路', '新天地', '老西门', '豫园', '南京东路', '天潼路', '四川北路', '海伦路', '邮电新村', '四平路', '同济大学', '国权路', '五角场', '江湾体育场', '三门路', '殷高东路 ', '新江湾城', '国帆路', '双江路', '高桥西', '高桥', '港城路', '基隆路']
  },
  {
    'line': '11号线',
    'station': ['花桥', '光明路', '兆丰路', '安亭', '上海汽车城', '昌吉东路', '上海赛车场', '嘉定北', '嘉定西', '白银路', '嘉定新城', '马陆', '陈翔公路', '南翔', '桃浦新村', '武威路', '祁连山路', '李子园', '上海西站', '真如', '枫桥路', '曹杨路', '隆德路', '江苏路', '交通大学', '徐家汇', '上海游泳馆', '龙华', '云锦路', '龙耀路', '东方体育中心', '三林', '三林东', '浦三路', '御桥', '罗山路', '秀沿路', '康新公路', '迪士尼']
  },
  {
    'line': '12号线',
    'station': ['七莘路', '虹莘路', '顾戴路', '东兰路', '虹梅路', '虹漕路', '桂林公园', '漕宝路', '龙漕路', '龙华', '龙华中路', '大木桥路', '嘉善路', '陕西南路', '南京西路', '汉中路', '曲阜路', '天潼路', '国际客运中心', '提篮桥', '大连路', '江浦公园', '宁国路', '隆昌路', '爱国路', '复兴岛', '东陆路', '巨峰路', '杨高北路', '金京路', '申江路', '金海路']
  },
  {
    'line': '13号线',
    'station': ['金运路', '金沙江西路', '丰庄', '祁连山南路', '真北路', '大渡河路', '金沙江路', '隆德路', '武宁路', '长寿路', '江宁路', '汉中路', '自然博物馆', '南京西路', '淮海中路', '新天地', '马当路', '世博会博物馆', '世博大道', '长清路', '成山路', '东明路', '华鹏路 ', '下南路', '北蔡', '陈春路 ', '莲溪路 ', '华夏中路', '中科路', '学林路 ', '张江路']
  },
  {
    'line': '16号线',
    'station': ['龙阳路', '华夏中路', '罗山路', '周浦东', '鹤沙航城', '航头东', '新场', '野生动物园', '惠南', '惠南东', '书院', '临港大道', '滴水湖']
  },
  {
    'line': '17号线',
    'station': ['虹桥火车站', '诸光路', '蟠龙路', '徐盈路', '徐泾北城', '嘉松中路', '赵巷', '汇金路', '青浦新城', '漕盈路', '淀山湖大道', '朱家角', '东方绿舟']
  },
  {
    'line': '18号线',
    'station': ['航头', '下沙', '鹤涛路', '沈梅路', '繁荣路', '周浦', '康桥', '御桥']
  },
  {
    'line': '浦江线',
    'station': ['沈杜公路', '三鲁公路', '闵瑞路', '浦航路', '东城一路', '汇臻路']
  }
]

export function getMetroLineOptions () {
  return subwayOptions.map(e => { return { label: e.line, value: e.line } })
}

export function getLabel (value, options) {
  const e = options.find(element => {
    return element.value === value
  })
  if (e) {
    return e.label
  }
  return value
}
export const transactionOwnershipOptions = [
  {
    label: '商品房',
    value: '商品房'
  },
  {
    label: '动迁',
    value: '动迁'
  },
  {
    label: '售后公房',
    value: '售后公房'
  },
  {
    label: '其他',
    value: '其他'
  }
]
export const peopleAndVehiclesOptions = [
  {
    label: '全人车分流',
    value: '1'
  },
  {
    label: '半人车分流',
    value: '2'
  },
  {
    label: '其他',
    value: '3'
  }
]
export const metroDistanceOption = [
  {
    label: '200米以内',
    value: '0-200'
  },
  {
    label: '500米以内',
    value: '0-500'
  },
  {
    label: '1000米以内',
    value: '0-1000'
  },
  {
    label: '2000米以内',
    value: '0-2000'
  },
  {
    label: '3000米以内',
    value: '0-4000'
  },
  {
    label: '5000米以内',
    value: '0-5000'
  }
]
export const parkingSpaceRatioOptions = [
  {
    label: '小于0.5',
    value: '0-0.5'
  },
  {
    label: '0.5-1.0',
    value: '0.5-1.0'
  },
  {
    label: '1.0-1.5',
    value: '1.0-1.5'
  },
  {
    label: '1.5-2.0',
    value: '1.5-2.0'
  },
  {
    label: '大于2.0',
    value: '2.0-100'
  }
]
export const volume2019Options = [
  {
    label: '5套以下',
    value: '0-5'
  },
  {
    label: '5-10套',
    value: '5-10'
  },
  {
    label: '10-50套',
    value: '10-50'
  },
  {
    label: '50-100套',
    value: '50-100'
  },
  {
    label: '100-150套',
    value: '100-150'
  },
  {
    label: '150-200套',
    value: '150-200'
  },
  {
    label: '200-250套',
    value: '200-250'
  },
  {
    label: '250-300套',
    value: '250-3000'
  },
  {
    label: '300-350套',
    value: '300-350'
  },
  {
    label: '350-400套',
    value: '350-400'
  },
  {
    label: '400套以上',
    value: '400-100000'
  }
]
export const propertyOptions = [
  {
    label: '住宅',
    value: '住宅'
  },
  {
    label: '别墅',
    value: '别墅'
  },
  {
    label: '商住',
    value: '商住'
  },
  {
    label: '其他',
    value: '其他'
  }
]

export const communityLevOptions = [
  {
    label: 'A+',
    value: 'A+'
  },
  {
    label: 'A',
    value: 'A'
  },
  {
    label: 'B',
    value: 'B'
  },
  {
    label: 'C',
    value: 'C'
  },
  {
    label: 'D',
    value: 'D'
  }
]
export const districtPlanningOptions = [
  {
    label: '城市主中心',
    value: '城市主中心'
  },
  {
    label: '城市副中心',
    value: '城市副中心'
  },
  {
    label: '地区中心',
    value: '地区中心'
  },
  {
    label: '其他',
    value: '其他'
  }
]
